export default {
  // --------------数据错误---------------
  // 网络超时
  netTimeOut: [
    '0X001',
    '0X003',
    '0X004',
    '0X005',
    '0X007',
    '0X008',
    '301001',
    '301002',
    '301005',
    '301007',
    '301009',
    '701019',
    '701020'
  ],
  // 投注时错误提示 “赛事赔率更新中，请稍后再试”
  matchIorUpdatingCodes: [
    '1X000',
    '1X001',
    '1X002',
    '1X003',
    '1X009',
    '1X010',
    '1100017',
    '1100018',
    '1100033',
    '1X013',
    '1X021'
  ],
  // 赛事间隔超过7天 错误提示
  matchOver7DayErrorCode: ['1x028'],
  // 系统安全维护中，约10分钟结束
  sysMaintainCodes: ['0X006', '701016', '701017'],
  // 点水数据错误
  // 网络请求超时，未能获取交易赔率
  pwNetTimeOut: [
    '0X001',
    '0X003',
    '0X004',
    '0X005',
    '0X007',
    '0X008',
    '301001',
    '301002',
    '301005',
    '301007',
    '301009',
    '701019',
    '701020',
    'B002',
    'B003',
    'B004',
    'B005',
    '-13'
  ],
  // 盘口暂停
  pwRatioPauseCodes: [
    '1X007',
    '1X009',
    '1X010',
    '1X004',
    '1X006',
    '1X008',
    '1X012',
    '1X016',
    '1X017',
    '1X018',
    '1X019',
    '1X020',
    '1X022',
    '1X023',
    '301004',
    '301006',
    '301010'
  ],
  // --------------系统错误---------------
  // 网络超时
  netErrorCodes: [
    301001, 301002, 301004, 301005, 301006, 301007, 301009, 301022, 301024,
    701001, 701002, 701003, 701012, 701013, 701017, 701018, 701019, 701020, -1,
    -7, 406, 1100034, 1100035, -13
  ],
  // 点水时盘口关闭
  pwMatchCloseCodes: [301008, 301017, 301018],
  // 投注失败
  betFailCodes: [1100006, 301021, 301023, 701024, 701027],
  // 会员1分钟只允许登入5次
  memberLoginCountCode: 701026,
  // 点水频率过高
  pwHighFrequencyCode: 1100036,
  // 账户异常
  unusualAccountCodes: [901006, 901007, 901008],
  // 投注频率过快
  betHighFrequencyCode: 428,
  // 投注时错误提示 “赛事赔率更新中，请稍后再试”
  sysMatchIorUpdatingCodes: [
    301007, 301008, 301017, 301018, 301022, 301024, 701001, 701002, 701003,
    701012, 701013, 701025
  ]
}
